-- MySQL dump 10.19  Distrib 10.3.29-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: dev
-- ------------------------------------------------------
-- Server version	10.3.29-MariaDB-0ubuntu0.20.10.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `shop_ip_kladr_api_region`
--

DROP TABLE IF EXISTS `shop_ip_kladr_api_region`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `shop_ip_kladr_api_region` (
  `id` varchar(13) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `zip` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `type_short` varchar(255) DEFAULT NULL,
  `okato` varchar(255) DEFAULT NULL,
  `content_type` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `shop_ip_kladr_api_region`
--

LOCK TABLES `shop_ip_kladr_api_region` WRITE;
/*!40000 ALTER TABLE `shop_ip_kladr_api_region` DISABLE KEYS */;
INSERT INTO `shop_ip_kladr_api_region` VALUES ('0100000000000','Адыгея','385000','Республика','Респ','79000000000','region'),('0400000000000','Алтай','649000','Республика','Респ','84000000000','region'),('2200000000000','Алтайский',NULL,'Край','край','01000000000','region'),('2800000000000','Амурская','675000','Область','обл','10000000000','region'),('2900000000000','Архангельская',NULL,'Область','обл','11000000000','region'),('3000000000000','Астраханская',NULL,'Область','обл','12000000000','region'),('0200000000000','Башкортостан','452000','Республика','Респ','80000000000','region'),('3100000000000','Белгородская',NULL,'Область','обл','14000000000','region'),('3200000000000','Брянская',NULL,'Область','обл','15000000000','region'),('0300000000000','Бурятия','671000','Республика','Респ','81000000000','region'),('3300000000000','Владимирская',NULL,'Область','обл','17000000000','region'),('3400000000000','Волгоградская',NULL,'Область','обл','18000000000','region'),('3500000000000','Вологодская',NULL,'Область','обл','19000000000','region'),('3600000000000','Воронежская',NULL,'Область','обл','20000000000','region'),('0500000000000','Дагестан','368000','Республика','Респ','82000000000','region'),('7900000000000','Еврейская',NULL,'Автономная область','Аобл','99000000000','region'),('7500000000000','Забайкальский',NULL,'Край','край','76000000000','region'),('3700000000000','Ивановская',NULL,'Область','обл','24000000000','region'),('0600000000000','Ингушетия','386000','Республика','Респ','26000000000','region'),('3800000000000','Иркутская',NULL,'Область','обл','25000000000','region'),('0700000000000','Кабардино-Балкарская',NULL,'Республика','Респ','83000000000','region'),('3900000000000','Калининградская',NULL,'Область','обл','27000000000','region'),('0800000000000','Калмыкия',NULL,'Республика','Респ','85000000000','region'),('4000000000000','Калужская',NULL,'Область','обл','29000000000','region'),('4100000000000','Камчатский',NULL,'Край','край','30000000000','region'),('0900000000000','Карачаево-Черкесская',NULL,'Республика','Респ','91000000000','region'),('1000000000000','Карелия',NULL,'Республика','Респ','86000000000','region'),('4200000000000','Кемеровская область - Кузбасс',NULL,'Область','обл','32000000000','region'),('4300000000000','Кировская','610000','Область','обл','33000000000','region'),('1100000000000','Коми',NULL,'Республика','Респ','87000000000','region'),('4400000000000','Костромская',NULL,'Область','обл','34000000000','region'),('2300000000000','Краснодарский',NULL,'Край','край','03000000000','region'),('2400000000000','Красноярский',NULL,'Край','край','04000000000','region'),('9100000000000','Крым',NULL,'Республика','Респ','35000000000','region'),('4500000000000','Курганская','641000','Область','обл','37000000000','region'),('4600000000000','Курская',NULL,'Область','обл','38000000000','region'),('4700000000000','Ленинградская',NULL,'Область','обл','41000000000','region'),('4800000000000','Липецкая',NULL,'Область','обл','42000000000','region'),('4900000000000','Магаданская',NULL,'Область','обл','44000000000','region'),('1200000000000','Марий Эл',NULL,'Республика','Респ','88000000000','region'),('1300000000000','Мордовия',NULL,'Республика','Респ','89000000000','region'),('7700000000000','Москва',NULL,'Город','г','45000000000','region'),('5000000000000','Московская',NULL,'Область','обл','46000000000','region'),('5100000000000','Мурманская',NULL,'Область','обл','47000000000','region'),('8300000000000','Ненецкий','166000','Автономный округ','АО','11100000000','region'),('5200000000000','Нижегородская',NULL,'Область','обл','22000000000','region'),('5300000000000','Новгородская',NULL,'Область','обл','49000000000','region'),('5400000000000','Новосибирская',NULL,'Область','обл','50000000000','region'),('5500000000000','Омская',NULL,'Область','обл','52000000000','region'),('5600000000000','Оренбургская','460000','Область','обл','53000000000','region'),('5700000000000','Орловская',NULL,'Область','обл','54000000000','region'),('5800000000000','Пензенская',NULL,'Область','обл','56000000000','region'),('5900000000000','Пермский',NULL,'Край','край','57000000000','region'),('2500000000000','Приморский',NULL,'Край','край','05000000000','region'),('6000000000000','Псковская',NULL,'Область','обл','58000000000','region'),('6100000000000','Ростовская',NULL,'Область','обл','60000000000','region'),('6200000000000','Рязанская','390000','Область','обл','61000000000','region'),('6300000000000','Самарская',NULL,'Область','обл','36000000000','region'),('7800000000000','Санкт-Петербург','190000','Город','г','40000000000','region'),('6400000000000','Саратовская','410000','Область','обл','63000000000','region'),('1400000000000','Саха /Якутия/',NULL,'Республика','Респ','98000000000','region'),('6500000000000','Сахалинская','693000','Область','обл','64000000000','region'),('6600000000000','Свердловская','620000','Область','обл','65000000000','region'),('9200000000000','Севастополь',NULL,'Город','г','67000000000','region'),('1500000000000','Северная Осетия - Алания',NULL,'Республика','Респ','90000000000','region'),('6700000000000','Смоленская',NULL,'Область','обл','66000000000','region'),('2600000000000','Ставропольский',NULL,'Край','край','07000000000','region'),('6800000000000','Тамбовская','392000','Область','обл','68000000000','region'),('1600000000000','Татарстан','420000','Республика','Респ','92000000000','region'),('6900000000000','Тверская',NULL,'Область','обл','28000000000','region'),('7000000000000','Томская',NULL,'Область','обл','69000000000','region'),('7100000000000','Тульская',NULL,'Область','обл','70000000000','region'),('1700000000000','Тыва','660000','Республика','Респ','93000000000','region'),('7200000000000','Тюменская',NULL,'Область','обл','71000000000','region'),('1800000000000','Удмуртская',NULL,'Республика','Респ','94000000000','region'),('7300000000000','Ульяновская','433000','Область','обл','73000000000','region'),('2700000000000','Хабаровский',NULL,'Край','край','08000000000','region'),('1900000000000','Хакасия','655000','Республика','Респ','95000000000','region'),('8600000000000','Ханты-Мансийский Автономный округ - Югра',NULL,'Автономный округ','АО','71100000000','region'),('7400000000000','Челябинская','454000','Область','обл','75000000000','region'),('2000000000000','Чеченская',NULL,'Республика','Респ','96000000000','region'),('2100000000000','Чувашская',NULL,'Республика','Респ','97000000000','region'),('8700000000000','Чукотский',NULL,'Автономный округ','АО','77000000000','region'),('8900000000000','Ямало-Ненецкий','629000','Автономный округ','АО','71140000000','region'),('7600000000000','Ярославская',NULL,'Область','обл','78000000000','region');
/*!40000 ALTER TABLE `shop_ip_kladr_api_region` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-07-28 11:11:50
